
  #### plan-nodes-20251130T151455.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.k8s-test.cloudflare_dns_record.delegation[0] will be destroyed
  # (because cloudflare_dns_record.delegation is not in configuration)
  - resource "cloudflare_dns_record" "delegation" {
      - comment             = "Managed by Terraform" -> null
      - comment_modified_on = "2025-11-28T15:05:14Z" -> null
      - content             = "ns-cloud-a1.googledomains.com" -> null
      - created_on          = "2025-11-28T15:05:14Z" -> null
      - id                  = "6e4ce76ec7b0af3504298f0b799d971a" -> null
      - meta                = jsonencode({})
      - modified_on         = "2025-11-28T15:05:14Z" -> null
      - name                = "tiles-test.symmatree.com" -> null
      - proxiable           = false -> null
      - proxied             = false -> null
      - settings            = {} -> null
      - tags                = [] -> null
      - ttl                 = 300 -> null
      - type                = "NS" -> null
      - zone_id             = "73b4d912118a49df40acea58c4983678" -> null
    }

  # module.k8s-test.cloudflare_dns_record.delegation[1] will be destroyed
  # (because cloudflare_dns_record.delegation is not in configuration)
  - resource "cloudflare_dns_record" "delegation" {
      - comment             = "Managed by Terraform" -> null
      - comment_modified_on = "2025-11-28T15:05:14Z" -> null
      - content             = "ns-cloud-a2.googledomains.com" -> null
      - created_on          = "2025-11-28T15:05:14Z" -> null
      - id                  = "c08b938fd75811cff26f49b983fffd12" -> null
      - meta                = jsonencode({})
      - modified_on         = "2025-11-28T15:05:14Z" -> null
      - name                = "tiles-test.symmatree.com" -> null
      - proxiable           = false -> null
      - proxied             = false -> null
      - settings            = {} -> null
      - tags                = [] -> null
      - ttl                 = 300 -> null
      - type                = "NS" -> null
      - zone_id             = "73b4d912118a49df40acea58c4983678" -> null
    }

  # module.k8s-test.cloudflare_dns_record.delegation[2] will be destroyed
  # (because cloudflare_dns_record.delegation is not in configuration)
  - resource "cloudflare_dns_record" "delegation" {
      - comment             = "Managed by Terraform" -> null
      - comment_modified_on = "2025-11-28T15:05:14Z" -> null
      - content             = "ns-cloud-a3.googledomains.com" -> null
      - created_on          = "2025-11-28T15:05:14Z" -> null
      - id                  = "cef5eb0b74d6b418b94ea8f0647d8d4d" -> null
      - meta                = jsonencode({})
      - modified_on         = "2025-11-28T15:05:14Z" -> null
      - name                = "tiles-test.symmatree.com" -> null
      - proxiable           = false -> null
      - proxied             = false -> null
      - settings            = {} -> null
      - tags                = [] -> null
      - ttl                 = 300 -> null
      - type                = "NS" -> null
      - zone_id             = "73b4d912118a49df40acea58c4983678" -> null
    }

  # module.k8s-test.cloudflare_dns_record.delegation[3] will be destroyed
  # (because cloudflare_dns_record.delegation is not in configuration)
  - resource "cloudflare_dns_record" "delegation" {
      - comment             = "Managed by Terraform" -> null
      - comment_modified_on = "2025-11-28T15:05:14Z" -> null
      - content             = "ns-cloud-a4.googledomains.com" -> null
      - created_on          = "2025-11-28T15:05:14Z" -> null
      - id                  = "e80847bc5fe9ecb056715f7a5c26e059" -> null
      - meta                = jsonencode({})
      - modified_on         = "2025-11-28T15:05:14Z" -> null
      - name                = "tiles-test.symmatree.com" -> null
      - proxiable           = false -> null
      - proxied             = false -> null
      - settings            = {} -> null
      - tags                = [] -> null
      - ttl                 = 300 -> null
      - type                = "NS" -> null
      - zone_id             = "73b4d912118a49df40acea58c4983678" -> null
    }

  # module.k8s-test.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be destroyed
  # (because google_dns_managed_zone_iam_member.cert_manager_dns01_public is not in configuration)
  - resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      - etag         = "BwZETbMexbg=" -> null
      - id           = "projects/symm-custodes/managedZones/tiles-test/roles/dns.admin/serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - managed_zone = "projects/symm-custodes/managedZones/tiles-test" -> null
      - member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - project      = "symm-custodes" -> null
      - role         = "roles/dns.admin" -> null
    }

  # module.k8s-test.google_dns_managed_zone_iam_member.external_dns_public will be destroyed
  # (because google_dns_managed_zone_iam_member.external_dns_public is not in configuration)
  - resource "google_dns_managed_zone_iam_member" "external_dns_public" {
      - etag         = "BwZETbMexbg=" -> null
      - id           = "projects/symm-custodes/managedZones/tiles-test/roles/dns.admin/serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - managed_zone = "projects/symm-custodes/managedZones/tiles-test" -> null
      - member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - project      = "symm-custodes" -> null
      - role         = "roles/dns.admin" -> null
    }

  # module.k8s-test.google_project_iam_member.cert_manager_dns01_dns_reader will be destroyed
  # (because google_project_iam_member.cert_manager_dns01_dns_reader is not in configuration)
  - resource "google_project_iam_member" "cert_manager_dns01_dns_reader" {
      - etag    = "BwZEweZZRfI=" -> null
      - id      = "symm-custodes/roles/dns.reader/serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - project = "symm-custodes" -> null
      - role    = "roles/dns.reader" -> null
    }

  # module.k8s-test.google_project_iam_member.external_dns_dns_reader will be destroyed
  # (because google_project_iam_member.external_dns_dns_reader is not in configuration)
  - resource "google_project_iam_member" "external_dns_dns_reader" {
      - etag    = "BwZEweZZRfI=" -> null
      - id      = "symm-custodes/roles/dns.reader/serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - project = "symm-custodes" -> null
      - role    = "roles/dns.reader" -> null
    }

  # module.k8s-test.google_service_account.cert_manager_dns01 will be destroyed
  # (because google_service_account.cert_manager_dns01 is not in configuration)
  - resource "google_service_account" "cert_manager_dns01" {
      - account_id   = "sa-tiles-test-cert-manager" -> null
      - description  = "Service account for tiles-test cert-manager to perform DNS01 ACME challenges" -> null
      - disabled     = false -> null
      - display_name = "tiles-test cert-manager DNS01 Solver" -> null
      - email        = "sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - id           = "projects/symm-custodes/serviceAccounts/sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - name         = "projects/symm-custodes/serviceAccounts/sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - project      = "symm-custodes" -> null
      - unique_id    = "111341647250692277812" -> null
    }

  # module.k8s-test.google_service_account.external_dns will be destroyed
  # (because google_service_account.external_dns is not in configuration)
  - resource "google_service_account" "external_dns" {
      - account_id   = "sa-tiles-test-external-dns" -> null
      - description  = "Service account for tiles-test external-dns to manage DNS records" -> null
      - disabled     = false -> null
      - display_name = "tiles-test external-dns" -> null
      - email        = "sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - id           = "projects/symm-custodes/serviceAccounts/sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - name         = "projects/symm-custodes/serviceAccounts/sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - project      = "symm-custodes" -> null
      - unique_id    = "116119140703340858898" -> null
    }

  # module.k8s-test.google_service_account_key.cert_manager_dns01_sa_key will be destroyed
  # (because google_service_account_key.cert_manager_dns01_sa_key is not in configuration)
  - resource "google_service_account_key" "cert_manager_dns01_sa_key" {
      - id                 = "projects/symm-custodes/serviceAccounts/sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com/keys/1d60bf63b8b28ea394313d11ee6618ff1759aa1b" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/symm-custodes/serviceAccounts/sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com/keys/1d60bf63b8b28ea394313d11ee6618ff1759aa1b" -> null
      - private_key        = (sensitive value) -> null
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvVENDQWVXZ0F3SUJBZ0lKQVBRbkJJRlBVZGJ6TUEwR0NTcUdTSWIzRFFFQkJRVUFNQ0F4SGpBY0JnTlYKQkFNTUZURXhNVE0wTVRZME56STFNRFk1TWpJM056Z3hNakFnRncweU5URXhNVFl5TWpNNU1qWmFHQTg1T1RrNQpNVEl6TVRJek5UazFPVm93SURFZU1Cd0dBMVVFQXd3Vk1URXhNelF4TmpRM01qVXdOamt5TWpjM09ERXlNSUlCCklqQU5CZ2txaGtpRzl3MEJBUUVGQUFPQ0FROEFNSUlCQ2dLQ0FRRUF0ampzRDRhcG54elQ0SDAxSjBORElEMTgKVzQ5b0d3UytIaGNDcVJEMGt1bzNKSHhFRzhqdEltTEdiZUxPVi9LU1lpNW5qNG5NdS9XSitWUysyekUyNEgvcQpqTUtJSWcwcjdrNDNlT3dLSHJONFNCdFZMWnY2dW84OFE2dk1TM3Iva1IvUVE5dG4xbmozK2NUVURzWU03bUpECjFvcVc5VzFabkFOTklGRUlUazJlQnNBblNIeFhGTnlId3JiNXhocmNKeGh6UG5ySThwMU81Sml6eStpVVFnTWsKZGJzSXo5UXRvZzhuaFhkeXNhRlJSMG5SYmxRZFc1ZnJzeWxndm9WcVBBQUNPSERKZ3BLLzA3RW1hN0c0MTYrSAp1OVRGNm9mRWJYU3IvMmxQSlVNWkQzLytYRGhOOHV2bGcyMHFYcG55dUxNR25EQjRVellPUGlncUNFVWtnd0lECkFRQUJvemd3TmpBTUJnTlZIUk1CQWY4RUFqQUFNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVdCZ05WSFNVQkFmOEUKRERBS0JnZ3JCZ0VGQlFjREFqQU5CZ2txaGtpRzl3MEJBUVVGQUFPQ0FRRUFXL0lOYU1QT01JbU1yTWNNdTRscgpuK2ZhMEQ0cjcrUXFnNVdqVDVzZ1Q3V2ZmSk1RUGJoSG02UktRK2ZOWHJ3Q1Z2OFpMV1FPM0N2cHlGUXNYWEhuCnJBNlFHc1g0VFBIdHorMW5mUjRieUN3cjM3Y05ydkpPcGJEQ3cxK2tTVFBBeHhQdmtQSEdmUUFvaUV5aWNndmEKS2NuVUFzVDh0T2tIem9BdWhHWnd1QlJwN0tlRzlPTTdzZlYyU2szMmdTVVVrRk80TCsrb0NzT0t5OVZKZ29kLwphUk1aZWJQMXNPVXpPaWdDZitLUFpFSjk3YUxFcTFxeUFYNWMvL2ZiM1BCOFdZRUcrRjFCcnMxcVF0bkFPSXgvCjY1cHBXc1lmMWdVeS84TVhjTmg2NEcxeW4vUFRSaE95bzI3YzY2eWFsZi9BY1dya2xLeXFlRmpwZ1FXdEZpSGgKTlE9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/symm-custodes/serviceAccounts/sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com" -> null
      - valid_after        = "2025-11-16T22:39:26Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # module.k8s-test.google_service_account_key.external_dns_sa_key will be destroyed
  # (because google_service_account_key.external_dns_sa_key is not in configuration)
  - resource "google_service_account_key" "external_dns_sa_key" {
      - id                 = "projects/symm-custodes/serviceAccounts/sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com/keys/0992906da867c6018997e2c7d2b341dda12730d3" -> null
      - key_algorithm      = "KEY_ALG_RSA_2048" -> null
      - name               = "projects/symm-custodes/serviceAccounts/sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com/keys/0992906da867c6018997e2c7d2b341dda12730d3" -> null
      - private_key        = (sensitive value) -> null
      - private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE" -> null
      - public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvVENDQWVXZ0F3SUJBZ0lKQU5YcTI3Sk5XR09mTUEwR0NTcUdTSWIzRFFFQkJRVUFNQ0F4SGpBY0JnTlYKQkFNTUZURXhOakV4T1RFME1EY3dNek0wTURnMU9EZzVPREFnRncweU5URXhNalF3TWpFeU5EZGFHQTg1T1RrNQpNVEl6TVRJek5UazFPVm93SURFZU1Cd0dBMVVFQXd3Vk1URTJNVEU1TVRRd056QXpNelF3T0RVNE9EazRNSUlCCklqQU5CZ2txaGtpRzl3MEJBUUVGQUFPQ0FROEFNSUlCQ2dLQ0FRRUF6YStvSjZGUEVPUnJwZm5jaXAxR1RaVUsKaDIrRnU5S3BHN2VVNnVad25ST3BSNHNJRFNxQjlydnYzMmNVMFZnKzUvRTdpN0xSbmtHZXVqQmQzOFNFTFl3aApPem9RVUFHd241dTlWTXkzeWw5N3VjSXIwR0NoeHhKQjk2V052WUh5c3ZQdmlqdlMwOWZyQk9jZVovakdUQ1RyCjMwN2dCcWlTL0V4ZGxKa3UwUXZjcXFUUXlyQkRrcEtHaXhwT0V3ako3d09Ncnl2V081aEpsOUhuYlNpWEs1NUEKR0UyNVJOR05QaWZnN1RobkFXTyttbW1rU1ZYQUltQklkUHJWZVBzaEJPSDREcjc3VkR4Ynp5d3FuajlYSG5yZQpQYnBVV0t5YndsMFJLZEJFZC9MSnEwM1Y1ZkYwZVREMk14Tll2QlcyMWtranZ5MmFjRGZPZkw4RnVyeFVhd0lECkFRQUJvemd3TmpBTUJnTlZIUk1CQWY4RUFqQUFNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVdCZ05WSFNVQkFmOEUKRERBS0JnZ3JCZ0VGQlFjREFqQU5CZ2txaGtpRzl3MEJBUVVGQUFPQ0FRRUFmei8xWVRDUzJubXBYc0NvZXllZAp4QXAyeE1VcjlsNmRIbXVXTFVzTnVCb3QwOWp0K1lqY01BMlVNanF3Zm9ZaUxKaUlyUDd4Y29hcllTQURvMWUyCll3VUMzY1VRY2owcTRqQ0FTMWFpRWNnQVd6azViM2plS215a2g2NkJDd2xmVEM5dTRMR1R3RDRBMUJSeWdneGQKODNQWE1uZGU4b3p3ZjlQdG5XWjdFOG5MaWtNUnRTSEJheHZZLy9jSEIwVUFobzR4dEY5WDRhakpGWmtBcUN5RQpGTUxpVFpqamtLdE9IZkxsbHRLVkRMd2JqUHBZa2xWRkxPYUhtZ0JZNldsQ1ZneHBjL2psQzl1cnRBWUVVZGZ0CjVUK2lPaGg0OXhiWndIemRCNUx3Z3Q4aTFrMDlscXpkbnJ0Wjl4RGdmWWtFTXRWNHhvUHhjdEp4QTA4d3BybUcKRVE9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
      - public_key_type    = "TYPE_X509_PEM_FILE" -> null
      - service_account_id = "projects/symm-custodes/serviceAccounts/sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com" -> null
      - valid_after        = "2025-11-24T02:12:47Z" -> null
      - valid_before       = "9999-12-31T23:59:59Z" -> null
    }

  # module.k8s-test.onepassword_item.cert_manager_dns01_sa_key will be destroyed
  # (because onepassword_item.cert_manager_dns01_sa_key is not in configuration)
  - resource "onepassword_item" "cert_manager_dns01_sa_key" {
      - category = "secure_note" -> null
      - id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/h2vqgxdahoa6ua3fixrvo42oou" -> null
      - title    = "tiles-test-cert-manager-dns01-sa-key" -> null
      - uuid     = "h2vqgxdahoa6ua3fixrvo42oou" -> null
      - vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y" -> null

      - section {
          - id    = "390d55de-b95e-7a7f-c503-bd3ffc6d0d12" -> null
          - label = "credentials" -> null

          - field {
              - id    = "meswwu7xlb7ywi236z72meclvy" -> null
              - label = "private_key.json" -> null
              - type  = "CONCEALED" -> null
              - value = (sensitive value) -> null
            }
        }
      - section {
          - id    = "be7b2b32-5855-3d1f-2710-ef0dee753eaa" -> null
          - label = "metadata" -> null

          - field {
              - id    = "pwf2oo2vyhb6g2vl6j4rczmldq" -> null
              - label = "source" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
          - field {
              - id    = "276mpoznes2n4xigiurd7uybwq" -> null
              - label = "root_module" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
          - field {
              - id    = "aiwtsp3awv7c2tt5chc6iuapmy" -> null
              - label = "module" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
        }
    }

  # module.k8s-test.onepassword_item.external_dns_clouddns_sa_key will be destroyed
  # (because onepassword_item.external_dns_clouddns_sa_key is not in configuration)
  - resource "onepassword_item" "external_dns_clouddns_sa_key" {
      - category = "secure_note" -> null
      - id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/d7nf6mhvi735gi36sojxubxtze" -> null
      - title    = "tiles-test-external-dns-clouddns-sa-key" -> null
      - uuid     = "d7nf6mhvi735gi36sojxubxtze" -> null
      - vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y" -> null

      - section {
          - id    = "436e6391-bf50-d63d-8e8d-768141192144" -> null
          - label = "credentials" -> null

          - field {
              - id    = "qfdnqwgib7xoxqycc7pyrazpae" -> null
              - label = "credential.json" -> null
              - type  = "CONCEALED" -> null
              - value = (sensitive value) -> null
            }
        }
      - section {
          - id    = "f4c6e00f-68e2-1a02-72bf-351e72381744" -> null
          - label = "metadata" -> null

          - field {
              - id    = "pxmretb7rowwbnmn6lt3rgvofu" -> null
              - label = "source" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
          - field {
              - id    = "qnxbhvrd6y2jhvbk5kvap3bmpi" -> null
              - label = "root_module" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
          - field {
              - id    = "rcp6gqlzxgxyhzhtonu4ogdm4e" -> null
              - label = "module" -> null
              - type  = "STRING" -> null
              - value = (sensitive value) -> null
            }
        }
    }

  # module.tiles-test.onepassword_item.misc_config[0] will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/necdvhy3u3l4cm2kz7fzqme4ie"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "901c8b8d-bf4b-d6a1-2449-20d8b4852b3a"
            # (1 unchanged attribute hidden)

          + field {
              + id    = (known after apply)
              + label = "loki_bucket_chunks"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_ruler"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_admin"
              + type  = "STRING"
              + value = (sensitive value)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.k8s-test.module.dns-public-zone.google_dns_managed_zone.public[0] will be destroyed
  # (because google_dns_managed_zone.public is not in configuration)
  - resource "google_dns_managed_zone" "public" {
      - creation_time    = "2025-11-22T22:25:55.320Z" -> null
      - description      = "Managed by Terraform" -> null
      - dns_name         = "tiles-test.symmatree.com." -> null
      - effective_labels = {
          - "cluster"                    = "tiles-test"
          - "goog-terraform-provisioned" = "true"
          - "name"                       = "tiles-test"
        } -> null
      - force_destroy    = false -> null
      - id               = "projects/symm-custodes/managedZones/tiles-test" -> null
      - labels           = {
          - "cluster" = "tiles-test"
          - "name"    = "tiles-test"
        } -> null
      - managed_zone_id  = 1953311822654094376 -> null
      - name             = "tiles-test" -> null
      - name_servers     = [
          - "ns-cloud-a1.googledomains.com.",
          - "ns-cloud-a2.googledomains.com.",
          - "ns-cloud-a3.googledomains.com.",
          - "ns-cloud-a4.googledomains.com.",
        ] -> null
      - project          = "symm-custodes" -> null
      - terraform_labels = {
          - "cluster"                    = "tiles-test"
          - "goog-terraform-provisioned" = "true"
          - "name"                       = "tiles-test"
        } -> null
      - visibility       = "public" -> null

      - cloud_logging_config {
          - enable_logging = false -> null
        }
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be destroyed
  # (because google_dns_record_set.cloud-static-records is not in configuration)
  - resource "google_dns_record_set" "cloud-static-records" {
      - id           = "projects/symm-custodes/managedZones/tiles-test/rrsets/tiles-test.symmatree.com./NS" -> null
      - managed_zone = "tiles-test" -> null
      - name         = "tiles-test.symmatree.com." -> null
      - project      = "symm-custodes" -> null
      - rrdatas      = [
          - "ns.tiles-test.symmatree.com.",
        ] -> null
      - ttl          = 300 -> null
      - type         = "NS" -> null
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be destroyed
  # (because google_dns_record_set.cloud-static-records is not in configuration)
  - resource "google_dns_record_set" "cloud-static-records" {
      - id           = "projects/symm-custodes/managedZones/tiles-test/rrsets/localhost.tiles-test.symmatree.com./A" -> null
      - managed_zone = "tiles-test" -> null
      - name         = "localhost.tiles-test.symmatree.com." -> null
      - project      = "symm-custodes" -> null
      - rrdatas      = [
          - "127.0.0.1",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be destroyed
  # (because google_dns_record_set.cloud-static-records is not in configuration)
  - resource "google_dns_record_set" "cloud-static-records" {
      - id           = "projects/symm-custodes/managedZones/tiles-test/rrsets/ns.tiles-test.symmatree.com./A" -> null
      - managed_zone = "tiles-test" -> null
      - name         = "ns.tiles-test.symmatree.com." -> null
      - project      = "symm-custodes" -> null
      - rrdatas      = [
          - "127.0.0.1",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # module.tiles-test.module.k8s.cloudflare_dns_record.delegation[0] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.tiles-test.module.k8s.cloudflare_dns_record.delegation[1] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.tiles-test.module.k8s.cloudflare_dns_record.delegation[2] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.tiles-test.module.k8s.cloudflare_dns_record.delegation[3] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.tiles-test.module.k8s.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be created
  + resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + project      = "symm-custodes"
      + role         = "roles/dns.admin"
    }

  # module.tiles-test.module.k8s.google_dns_managed_zone_iam_member.external_dns_public will be created
  + resource "google_dns_managed_zone_iam_member" "external_dns_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + project      = "symm-custodes"
      + role         = "roles/dns.admin"
    }

  # module.tiles-test.module.k8s.google_project_iam_member.cert_manager_dns01_dns_reader will be created
  + resource "google_project_iam_member" "cert_manager_dns01_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + project = "symm-custodes"
      + role    = "roles/dns.reader"
    }

  # module.tiles-test.module.k8s.google_project_iam_member.external_dns_dns_reader will be created
  + resource "google_project_iam_member" "external_dns_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + project = "symm-custodes"
      + role    = "roles/dns.reader"
    }

  # module.tiles-test.module.k8s.google_service_account.cert_manager_dns01 will be created
  + resource "google_service_account" "cert_manager_dns01" {
      + account_id   = "sa-tiles-test-cert-manager"
      + description  = "Service account for tiles-test cert-manager to perform DNS01 ACME challenges"
      + disabled     = false
      + display_name = "tiles-test cert-manager DNS01 Solver"
      + email        = "sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account.external_dns will be created
  + resource "google_service_account" "external_dns" {
      + account_id   = "sa-tiles-test-external-dns"
      + description  = "Service account for tiles-test external-dns to manage DNS records"
      + disabled     = false
      + display_name = "tiles-test external-dns"
      + email        = "sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account.loki will be created
  + resource "google_service_account" "loki" {
      + account_id   = "tiles-test-loki"
      + description  = "Service account for tiles-test Loki"
      + disabled     = false
      + display_name = "tiles-test Loki Service Account"
      + email        = "tiles-test-loki@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account_key.cert_manager_dns01_sa_key will be created
  + resource "google_service_account_key" "cert_manager_dns01_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account_key.external_dns_sa_key will be created
  + resource "google_service_account_key" "external_dns_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.tiles-test.module.k8s.google_service_account_key.loki will be created
  + resource "google_service_account_key" "loki" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.tiles-test.module.k8s.htpasswd_password.loki_cluster_tenant will be created
  + resource "htpasswd_password" "loki_cluster_tenant" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.tiles-test.module.k8s.onepassword_item.cert_manager_dns01_sa_key will be created
  + resource "onepassword_item" "cert_manager_dns01_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-cert-manager-dns01-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "private_key.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.module.k8s.onepassword_item.external_dns_clouddns_sa_key will be created
  + resource "onepassword_item" "external_dns_clouddns_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-external-dns-clouddns-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.module.k8s.onepassword_item.gsa-loki will be created
  + resource "onepassword_item" "gsa-loki" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-gsa-loki"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.module.k8s.onepassword_item.loki_tenant_auth_secret will be created
  + resource "onepassword_item" "loki_tenant_auth_secret" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-loki-tenant-auth"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "username"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "password"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = ".htaccess"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.tiles-test.module.k8s.random_password.loki_cluster_tenant will be created
  + resource "random_password" "loki_cluster_tenant" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.tiles-test.module.k8s.module.dns-public-zone.google_dns_managed_zone.public[0] will be created
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "tiles-test.symmatree.com."
      + effective_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "cluster" = "tiles-test"
          + "name"    = "tiles-test"
        }
      + managed_zone_id  = (known after apply)
      + name             = "tiles-test"
      + name_servers     = (known after apply)
      + project          = "symm-custodes"
      + terraform_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }

      + dnssec_config (known after apply)
    }

  # module.tiles-test.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "ns.tiles-test.symmatree.com.",
        ]
      + ttl          = 300
      + type         = "NS"
    }

  # module.tiles-test.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "localhost.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.tiles-test.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "ns.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["admin"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-admin"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-admin"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["chunks"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-chunks"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-chunks"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["ruler"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-ruler"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-ruler"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["admin"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-admin"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["chunks"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-chunks"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["ruler"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-ruler"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_encryption_key.google_kms_crypto_key.key[0] will be created
  + resource "google_kms_crypto_key" "key" {
      + crypto_key_backend            = (known after apply)
      + destroy_scheduled_duration    = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                            = (known after apply)
      + import_only                   = false
      + key_ring                      = (known after apply)
      + name                          = "loki-storage"
      + primary                       = (known after apply)
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "7776000s"
      + skip_initial_version_creation = false
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.tiles-test.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.decrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "decrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyDecrypter"
    }

  # module.tiles-test.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.encrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "encrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypter"
    }

  # module.tiles-test.module.k8s.module.loki_encryption_key.google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "tiles-test-loki"
      + project  = "symm-custodes"
    }

Plan: 34 to add, 1 to change, 18 to destroy.

  ```

  </details>
  
  